nfe/arquivos/homologacao/temporarias/201611/147829852938145-enviNFe.xml

<?xml version="1.0" encoding="utf-8"?><soap12:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap12="http://www.w3.org/2003/05/soap-envelope"><soap12:Header><nfeCabecMsg xmlns="http://www.portalfiscal.inf.br/nfe/wsdl/NfeAutorizacao"><cUF>35</cUF><versaoDados>3.10</versaoDados></nfeCabecMsg></soap12:Header><soap12:Body><nfeDadosMsg xmlns="http://www.portalfiscal.inf.br/nfe/wsdl/NfeAutorizacao"><enviNFe xmlns="http://www.portalfiscal.inf.br/nfe" versao="3.10"><idLote>147829852938145</idLote><indSinc>1</indSinc><NFe xmlns="http://www.portalfiscal.inf.br/nfe"><infNFe Id="NFe35161016776504000138550010000000141000000141" versao="3.10"><ide><cUF>35</cUF><cNF>00000014</cNF><natOp>VENDA DE MERCADORIA</natOp><indPag>1</indPag><mod>55</mod><serie>1</serie><nNF>14</nNF><dhEmi>2016-10-26T00:00:00-02:00</dhEmi><dhSaiEnt>2016-10-26T00:00:00-02:00</dhSaiEnt><tpNF>1</tpNF><idDest>1</idDest><cMunFG>3512001</cMunFG><tpImp>1</tpImp><tpEmis>1</tpEmis><cDV>1</cDV><tpAmb>2</tpAmb><finNFe>1</finNFe><indFinal>0</indFinal><indPres>9</indPres><procEmi>0</procEmi><verProc>1.0</verProc></ide><emit><CNPJ>16776504000138</CNPJ><xNome>Net Solutions</xNome><xFant>Net Solutions</xFant><enderEmit><xLgr>av rui barbosa</xLgr><nro>1180</nro><xCpl>CASA</xCpl><xBairro>CENTRO da cidade</xBairro><cMun>3512001</cMun><xMun>COLINA</xMun><UF>SP</UF><CEP>14770000</CEP><cPais>1058</cPais><xPais>Brasil</xPais><fone>01733411033</fone></enderEmit><IE>268069639114</IE><CRT>1</CRT></emit><dest><CPF>322.830.028-50</CPF><xNome>NF-E EMITIDA EM AMBIENTE DE HOMOLOGACAO - SEM VALOR FISCAL</xNome><enderDest><xLgr>AV RUI BARBOSA ALTERADO</xLgr><nro>1180</nro><xCpl>CASA</xCpl><xBairro>CENTRO</xBairro><cMun>3512001</cMun><xMun>COLINA</xMun><UF>SP</UF><CEP>14770000</CEP><cPais>1058</cPais><xPais>Brasil</xPais><fone>01733413375</fone></enderDest><indIEDest>2</indIEDest><email>ANDRE_LUIZ@ETECBEBEDOURO.COM.BR</email></dest><total><ICMSTot><vBC>0.00</vBC><vICMS>0.00</vICMS><vICMSDeson>0.00</vICMSDeson><vBCST>0.00</vBCST><vST>0.00</vST><vProd>12.00</vProd><vFrete>0.00</vFrete><vSeg>0.00</vSeg><vDesc>0.00</vDesc><vII>0.00</vII><vIPI>0.00</vIPI><vPIS>0.00</vPIS><vCOFINS>0.00</vCOFINS><vOutro>0.00</vOutro><vNF>12.00</vNF><vTotTrib>0.00</vTotTrib></ICMSTot></total><transp><modFrete>0</modFrete></transp><infAdic><infAdFisco>TESTE</infAdFisco><infCpl>TESTE - Valor Aprox. Tributos R$ 0,00 - 0,00 Federal, 0,00 Estadual e 0,00 Municipal.</infCpl></infAdic></infNFe></NFe></enviNFe></nfeDadosMsg></soap12:Body></soap12:Envelope>