nfe/arquivos/producao/temporarias/201610/147752257882410-enviNFe.xml

<?xml version="1.0" encoding="utf-8"?><soap12:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap12="http://www.w3.org/2003/05/soap-envelope"><soap12:Header><nfeCabecMsg xmlns="http://www.portalfiscal.inf.br/nfe/wsdl/NfeAutorizacao"><cUF>35</cUF><versaoDados>3.10</versaoDados></nfeCabecMsg></soap12:Header><soap12:Body><nfeDadosMsg xmlns="http://www.portalfiscal.inf.br/nfe/wsdl/NfeAutorizacao"><enviNFe xmlns="http://www.portalfiscal.inf.br/nfe" versao="3.10"><idLote>147752257882410</idLote><indSinc>1</indSinc><NFe xmlns="http://www.portalfiscal.inf.br/nfe"><infNFe Id="NFe52160116776504000138550010000000011000000013" versao="3.10"><ide><cUF>52</cUF><cNF>1</cNF><natOp>Sou foda</natOp><indPag>1</indPag><mod>55</mod><serie>1</serie><nNF>1</nNF><dhEmi>2016-01-01</dhEmi><dhSaiEnt>1970-01-01</dhSaiEnt><tpNF>1</tpNF><idDest>1</idDest><cMunFG>5200258</cMunFG><tpImp>1</tpImp><tpEmis>1</tpEmis><cDV>3</cDV><tpAmb>2</tpAmb><finNFe>1</finNFe><indFinal>0</indFinal><indPres>9</indPres><procEmi>0</procEmi><verProc>1.0</verProc></ide><emit><CNPJ>16776504000138</CNPJ><xNome>Net Solutions</xNome><xFant>Net Solutions</xFant><enderEmit><xLgr>av rui barbosa</xLgr><nro>1180</nro><xCpl>CASA</xCpl><xBairro>CENTRO da cidade</xBairro><cMun>3512001</cMun><xMun>COLINA</xMun><UF>SA</UF><CEP>14770-000</CEP><cPais>1058</cPais><xPais>Brasil</xPais><fone>(017) 3341-1033</fone></enderEmit><IE>ISENTO</IE><CRT>1</CRT></emit><dest><CPF>322.830.028-50</CPF><xNome>NF-E EMITIDA EM AMBIENTE DE HOMOLOGACAO - SEM VALOR FISCAL</xNome><enderDest><xLgr>AV RUI BARBOSA ALTEREI</xLgr><nro>1180</nro><xCpl>CASA</xCpl><xBairro>CENTRO</xBairro><cMun>3512001</cMun><xMun>COLINA</xMun><UF>SP</UF><CEP>14770-000</CEP><cPais>1058</cPais><xPais>Brasil</xPais><fone>(017) 3341-3375</fone></enderDest><indIEDest>1</indIEDest><IE>12345</IE><email>ANDRE_LUIZ@ETECBEBEDOURO.COM.BR</email></dest><det nItem="1"><prod><cProd>0</cProd><cEAN/><xProd>Mouse USB</xProd><NCM/><CFOP>0</CFOP><uCom>UN</uCom><qCom>1.00</qCom><vUnCom>10.00</vUnCom><vProd>10.00</vProd><cEANTrib/><uTrib>UN</uTrib><qTrib>1.00</qTrib><vUnTrib>10.00</vUnTrib><indTot>1</indTot><xPed>1</xPed><nItemPed>1</nItemPed></prod><imposto><vTotTrib>449.90</vTotTrib><IPI><cEnq>999</cEnq><IPINT><CST>53</CST></IPINT></IPI><PIS><PISNT><CST>07</CST></PISNT></PIS><COFINS><COFINSQtde><CST>03</CST><qBCProd>60.00</qBCProd><vAliqProd>0.682</vAliqProd><vCOFINS>81.84</vCOFINS></COFINSQtde></COFINS></imposto></det><total><ICMSTot><vBC>1200.00</vBC><vICMS>288.00</vICMS><vICMSDeson>0.00</vICMSDeson><vBCST>1030.80</vBCST><vST>51.50</vST><vProd>1200.00</vProd><vFrete>0.00</vFrete><vSeg>0.00</vSeg><vDesc>0.00</vDesc><vII>0.00</vII><vIPI>50.40</vIPI><vPIS>41.70</vPIS><vCOFINS>92.64</vCOFINS><vOutro>0.00</vOutro><vNF>1301.90</vNF><vTotTrib>524.24</vTotTrib></ICMSTot></total><transp><modFrete>0</modFrete></transp><infAdic><infAdFisco>SDFSDFSD ALTERADOEWRWE</infAdFisco><infCpl>TESTEI E DESCOBRI QUE SOU O MELHOR QUE TA TENDO - Valor Aprox. Tributos R$ 523,00 - 184,74 Federal, 339,50 Estadual e 0,00 Municipal.</infCpl></infAdic></infNFe></NFe></enviNFe></nfeDadosMsg></soap12:Body></soap12:Envelope>